I'm afraid this has now broken my Terraform run (I'm using Postgres and I have an instance running with an option group - although not supported, it still created it a long time ago).

Unfortunately, there are cases where the option group can't just be removed immediately from a Postgres instance because of snapshots being attached to the option group. Here is the plan I got:

```hcl
# module.rds_app_db.module.db_instance.aws_db_instance.this[0] will be updated in-place
  ~ resource "aws_db_instance" "this" {
        id                                    = "my-dev-app-db"
        name                                  = "my"
      ~ parameter_group_name                  = "my-dev-app-db-20201027145803537200000001" -> (known after apply)

        # (48 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.rds_app_db.module.db_option_group.aws_db_option_group.this[0] will be destroyed
  - resource "aws_db_option_group" "this" {
      - arn                      = "arn:aws:rds:eu-west-2:xxxx:og:my-dev-app-db-20201027145803542000000002" -> null
      - engine_name              = "postgres" -> null
      - id                       = "my-dev-app-db-20201027145803542000000002" -> null
      - major_engine_version     = "12" -> null
      - name                     = "my-dev-app-db-20201027145803542000000002" -> null
      - name_prefix              = "my-dev-app-db-" -> null
      - option_group_description = "Option group for my-dev-app-db" -> null

      - timeouts {
          - delete = "15m" -> null
        }
    }

  # module.rds_app_db.module.db_parameter_group.aws_db_parameter_group.this[0] must be replaced
+/- resource "aws_db_parameter_group" "this" {
      ~ arn         = "arn:aws:rds:eu-west-2:xxx:pg:my-dev-app-db-20201027145803537200000001" -> (known after apply)
      ~ description = "Database parameter group for my-dev-app-db" -> "my-dev-app-db parameter group" # forces replacement
      ~ id          = "my-dev-app-db-20201027145803537200000001" -> (known after apply)
      ~ name        = "my-dev-app-db-20201027145803537200000001" -> (known after apply)

        # (2 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }
```

So if you have an RDS cluster that performs automated backups, you would need to manually remove all snapshots (which is also not great because they can only be removed by reducing the backup window to 0). The error message you get when attempting to delete:

```
You can’t delete a system snapshot. To remove system snapshots for an active DB instance, modify the DB instance and reduce the automated backup window. To remove system snapshots for a deleted instance, delete the retained automated backup.
```
 
My workaround was to:

1. Set backup window to 0
2. I used the AWS CLI to update to the default option group: 
```
aws rds modify-db-instance --db-instance-identifier my-dev-app-db --option-group-name default:postgres-12 --apply-immediately
```
3. Wait ~5 mins for RDS instance to be modified
4. Terraform apply - which will remove the option group and re-enable automated backups

@bryantbiggs @antonbabenko 